docs/site/mcdermott13_shoul_music_inter_be_easy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mcdermott13_shoul_music_inter_be_easy: Should Music Interaction Be Easy?</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">mcdermott13_shoul_music_inter_be_easy: Should Music Interaction Be Easy?</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#mcdermott13_shoul_music_inter_be_easy">Should Music Interaction Be Easy?</a>
<ul>
<li><a href="#org6b70c22">2.1 Introduction</a></li>
<li><a href="#org837508e">2.2 Dimensions of Difficulty</a></li>
<li><a href="#orgcab0c3b">2.4 Where Musical Interaction Must Be Difficult</a></li>
<li><a href="#org11d0fab">2.5 Where Musical Interaction Could Be Easier</a></li>
<li><a href="#orgefdd370">2.6 Conclusions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-mcdermott13_shoul_music_inter_be_easy" class="outline-2">
<h2 id="mcdermott13_shoul_music_inter_be_easy">Should Music Interaction Be Easy?</h2>
<div class="outline-text-2" id="text-mcdermott13_shoul_music_inter_be_easy">
<p>
The subject of ease of use in Music Interaction is complex with social, technical, artistic, and psychological resasons why difficulty can be a good thing. Sometimes though it is a necessary evil. (29)
</p>
</div>
<div id="outline-container-org6b70c22" class="outline-3">
<h3 id="org6b70c22">2.1 Introduction</h3>
<div class="outline-text-3" id="text-org6b70c22">
<p>
In music, what may seem like imperfections as far as tool design goes give personality to an instrument (30)
</p>

<p>
There is a trade off between ease of use and long term power. The long term power often makes things difficult for the beginner, but this is common in music. Instrumental performance, theory, notation, recording, etc. all take a long time to master. Long term power is favored over ease of use(30)
</p>
</div>
</div>
<div id="outline-container-org837508e" class="outline-3">
<h3 id="org837508e">2.2 Dimensions of Difficulty</h3>
<div class="outline-text-3" id="text-org837508e">
<p>
There is already a lot of difficulty in playing an instrument. There are physical demands like air pressure, span of fingers, weight of the instrument, etc. There is also coordination difficulty such as technical fingering passages, circular breathing, and more. There are discontinuities and nonlinearities in fingering systems. There is the difficulty of hearing what needs to be changed. Handling multiple streams of music, regardless if the isntrument is polyphonic or not. There can also be multiple ways to do the same thing, like multiple strings or fingerings. Basically, there are many aspects of difficulty in music that perhaps cannot be simplified without losing musical things we enjoy. (32-35)
</p>
</div>
</div>
<div id="outline-container-orgcab0c3b" class="outline-3">
<h3 id="orgcab0c3b">2.4 Where Musical Interaction Must Be Difficult</h3>
<div class="outline-text-3" id="text-orgcab0c3b">
<p>
Playing the instrument or piece of music is often the goal itself, not a means to a different goal. The satisfaction comes from achieving something difficult. (37)
Long term engagement, if we could all master our instruments in a few weeks, none of us would continue playing music. Part of the enjoyment, and difficulty, is that there is always something to do next. Guitar Hero is an example of short term engagement. Once the game is done it is done, the skills don't transfer necessarily to anything else.
There is also a seemingly universal appeal for open-endedness in activities. (38)
Things that are easy to use often are restrictive. They don't allow for expression or doing things it wasn't designed to do. In music, this could very much be a problem (38-39)
Virtuosity is often appreciated in music, and this requires difficulty as well. However with digital music much of the virtousity is unseen or unrecognized by the audience (39)
Physical effort and difficulty at times is useful to communicate intense moments to the audience, this is also hard to do on a digital instrument. (40)
</p>
</div>
</div>
<div id="outline-container-org11d0fab" class="outline-3">
<h3 id="org11d0fab">2.5 Where Musical Interaction Could Be Easier</h3>
<div class="outline-text-3" id="text-org11d0fab">
<p>
Transient or frivolous music (41)
Technical tasks like adjusting parameters for FM or Granular synthesis can be an obstacle to musicians. (41)
Layered affordance - ability to remove restrictions in layers
Adaptive affordance - System gauges when user is ready for more (42)
</p>
</div>
</div>
<div id="outline-container-orgefdd370" class="outline-3">
<h3 id="orgefdd370">2.6 Conclusions</h3>
<div class="outline-text-3" id="text-orgefdd370">
<p>
Sometimes users find interfaces frustrating, productivity not optimal, etc. But in music this is a good thing. Musicians need frustrations to grow. Playing music for the love of music is different than evaluating software.(43-44)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
